In [2]:
import numpy as np

In [3]:
import pandas as pd

In [4]:
pwd

'C:\\Users\\sgupta34\\Desktop\\ML\\MachineLearning'

In [5]:
myFrame = pd.read_csv('example-csv.csv')

In [6]:
myFrame

      1     2     3
0    11    22    33
1   111   222   333
2  1111  2222  3333

In [7]:
myFrame.to_csv('output.csv')

In [8]:
pd.read_csv('output.csv')

   Unnamed: 0     1     2     3
0           0    11    22    33
1           1   111   222   333
2           2  1111  2222  3333

In [9]:
pd.read_excel('example-excel.xlsx', sheet_name='Sheet1')

       1      2      3
0     11     22     33
1    111    222    333
2   1111   2222   3333
3  11111  22222  33333